Updated diagram.
